In [4]:
import pandas as pd

In [5]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [6]:
dataframe = pd.read_csv(url, error_bad_lines=False)

In [7]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 데이터프레임 만들기

In [9]:
dataframe = pd.DataFrame()

In [10]:
dataframe['Name']=['Jacky Jackson', 'Steven Stevenson']
dataframe['Age']=[38,25]
dataframe['Driver']=[True, False]

In [11]:
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [13]:
new_person=pd.Series(['Molly Mooney', 40, True],
                    index=['Name', 'Age', 'Driver'])

In [14]:
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [15]:
import numpy as np

In [16]:
data=[['Jacky Jackson', 38, True], ['Steven Stevenson', 25, False]]

In [17]:
matrix = np.array(data)
pd.DataFrame(matrix, columns=['Name', 'Age', 'Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [18]:
pd.DataFrame(data, columns=['Name', 'Age', 'Driver'])

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [19]:
data={'Name': ['Jacky Jackson', 'Steven Stevenson'],
     'Age':[38,25],
     'Driver':[True, False]}

In [20]:
pd.DataFrame(data)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [21]:
data=[{'Name': 'Jacky Jackson', 'Age': 38, 'Driver': True},
     {'Name': 'Steven Stevenson', 'Age': 25, 'Driver': False}]

In [22]:
pd.DataFrame(data, index=['row1', 'row2'])

                  Name  Age  Driver
row1     Jacky Jackson   38    True
row2  Steven Stevenson   25   False

## 3.2 데이터 설명하기

In [23]:
url='https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [24]:
dataframe=pd.read_csv(url)

In [25]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [26]:
dataframe.shape

(1313, 6)

In [27]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## 3.3 데이터프레임 탐색하기

In [28]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [29]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [30]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [31]:
dataframe = dataframe.set_index(dataframe['Name'])

In [32]:
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [33]:
dataframe.loc[:'Allison, Miss Helen Loraine', 'Age':'Sex']

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

In [37]:
dataframe[:'Allison, Miss Helen Loraine']

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [38]:
dataframe[['Age','Sex']].head(2)

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

## 3.4 조건에 따라 행 선택하기

In [39]:
dataframe[dataframe['Sex']=='female'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [40]:
dataframe[(dataframe['Sex']=='female')&(dataframe['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## 3.5 값 치환하기

In [41]:
dataframe['Sex'].replace("female","Woman").head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

In [42]:
dataframe['Sex'].replace(["female","male"],["Woman","Man"]).head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

In [43]:
dataframe.replace(1, "One").head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,One,One
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,One

In [44]:
dataframe.replace(r"1st","First", regex=True).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,female,0,1

In [45]:
dataframe.replace(["female","male"],"person").head(3)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,person,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,person,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,person,0,0

In [46]:
dataframe.rename(columns={'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [47]:
dataframe.rename(columns={'PClass':'Passenger Class', 'Sex' : 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [48]:
import collections

In [49]:
column_names=collections.defaultdict(str)

In [50]:
for name in dataframe.columns:
    column_names[name]

In [51]:
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [53]:
dataframe.rename(index={0:-1}).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [55]:
dataframe.rename(str.lower,axis='columns').head(2)

,name,pclass,age,sex,survived,sexcode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

## 3.7 최솟값, 최댓값, 합, 평균 계산 및 개수 세기

In [56]:
print('최댓값:', dataframe['Age'].max())
print('최솟값:', dataframe['Age'].min())
print('평균:',dataframe['Age'].mean())
print('합:',dataframe['Age'].sum())
print('카운트:',dataframe['Age'].count())

최댓값: 71.0
최솟값: 0.17
평균: 30.397989417989415
합: 22980.88
카운트: 756

In [57]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [58]:
dataframe.cov()

                 Age  Survived   SexCode
Age       203.320470 -0.430491 -0.382054
Survived   -0.430491  0.225437  0.114070
SexCode    -0.382054  0.114070  0.228230

In [59]:
dataframe.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

## 3.8 고유한 값 찾기

In [60]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [61]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [62]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [63]:
dataframe['PClass'].nunique()

4

In [64]:
dataframe.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

## 3.9 누락된 값 다루기

In [65]:
dataframe[dataframe['Age'].isnull()].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Aubert, Mrs Leontine Pauline","Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
"Barkworth, Mr Algernon H","Barkworth, Mr Algernon H",1st,NaN,male,1,0

In [66]:
dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: name 'NaN' is not defined

In [67]:
dataframe['Sex']=dataframe['Sex'].replace('male', np.nan)
dataframe=pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [68]:
dataframe=pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [70]:
dataframe=pd.read_csv(url, na_values=['female'], keep_default_na=False)
dataframe[12:14]

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [71]:
dataframe=pd.read_csv(url, na_filter=False)

In [72]:
dataframe[12:14]

                            Name PClass Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st      female         1        1
13      Barkworth, Mr Algernon H    1st        male         1        0

## 3.10 열 삭제하기

In [75]:
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [76]:
dataframe.drop(['Age','Sex'],axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [77]:
dataframe.drop(dataframe.columns[1],axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

## 3.11 행 삭제하기

In [78]:
dataframe = pd.read_csv(url, error_bad_lines=False)

In [79]:
dataframe[dataframe['Sex']!='male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [80]:
dataframe[dataframe['Name']!='Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [81]:
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

## 3.12 중복된 행 삭제하기

In [82]:
dataframe = pd.read_csv(url, error_bad_lines=False)

In [84]:
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [87]:
print("원본 데이터프레임 행의 수:", len(dataframe))

원본 데이터프레임 행의 수: 1313

In [89]:
print("중복 삭제 후 행의 수:", len(dataframe.drop_duplicates()))

중복 삭제 후 행의 수: 1313

In [90]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [91]:
dataframe.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

## 3.13 값에 따라 행을 그룹핑하기

In [97]:
dataframe = pd.read_csv(url, error_bad_lines=False)

In [92]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [98]:
dataframe.groupby('Sex')

In [100]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [101]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

## 3.14 시간에 따라 행을 그룹핑하기

In [102]:
time_index=pd.date_range('06/06/2017',periods=100000, freq='30S')

In [104]:
dataframe=pd.DataFrame(index=time_index)

In [105]:
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)

In [106]:
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86532
2017-06-18       101271
2017-06-25       101065
2017-07-02       100534
2017-07-09       101211
2017-07-16        10313

In [107]:
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            1
2017-06-06 00:00:30            1
2017-06-06 00:01:00            4

In [108]:
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     5.007639
2017-06-25     5.018254
2017-07-09     5.003596
2017-07-23     4.958173

In [109]:
dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [110]:
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [111]:
dataframe.resample('MS').count()

            Sale_Amount
2017-06-01        72000
2017-07-01        28000

## 3.15 열 원소 순회하기

In [113]:
dataframe=pd.read_csv(url)

In [114]:
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [115]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

## 3.16 모든 열 원소에 함수 적용하기

In [116]:
dataframe=pd.read_csv(url)

In [117]:
def uppercase(x):
    return x.upper()

In [118]:
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [119]:
dataframe['Survived'].map({1:'Live',0:'Dead'})[:5]

0    Live
1    Dead
2    Dead
3    Dead
4    Live
Name: Survived, dtype: object

In [120]:
dataframe['Age'].apply(lambda x, age: x < age, age=30)[:5]

0     True
1     True
2    False
3     True
4     True
Name: Age, dtype: bool

In [122]:
dataframe.apply(lambda x: max(x))

Name        del Carlo, Mrs Sebastiano (Argenia Genovese)
PClass                                               3rd
Age                                                   71
Sex                                                 male
Survived                                               1
SexCode                                                1
dtype: object

In [123]:
def truncate_string(x):
    if type(x) == str:
        return x[:20]
    return x

In [124]:
dataframe.applymap(truncate_string)[:5]

                   Name PClass    Age     Sex  Survived  SexCode
0  Allen, Miss Elisabet    1st  29.00  female         1        1
1  Allison, Miss Helen     1st   2.00  female         0        1
2  Allison, Mr Hudson J    1st  30.00    male         0        0
3  Allison, Mrs Hudson     1st  25.00  female         0        1
4  Allison, Master Huds    1st   0.92    male         1        0

## 3.17 그룹에 함수 적용하기

In [125]:
dataframe=pd.read_csv(url)

In [126]:
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

## 3.18 데이터프레임 연결하기

In [132]:
data_a = {'id': ['1','2','3'],
         'first':['Alex', 'Amy', 'Allen'],
         'last': ['Anderson', 'Ackerman', 'Ali']}

In [133]:
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

In [134]:
data_b = {'id': ['4','5','6'],
         'first':['Bily', 'Brian', 'Bran'],
         'last': ['Bonder', 'Black', 'Balwner']}

In [135]:
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

In [136]:
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4   Bily    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [137]:
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4   Bily   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [138]:
row=pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

In [139]:
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

In [142]:
row=pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

In [143]:
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

## 3.19 데이터프레임 병합하기

In [148]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
                'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
                        'Tim Horton']}

In [149]:
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

In [150]:
sales_data = {'employee_id': ['3', '4', '5', '6'],
                 'total_sales' : [23456, 2512, 2345, 1455]}

In [151]:
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
                                                     'total_sales'])

In [152]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [153]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [156]:
pd.merge(dataframe_employees,
        dataframe_sales,
        left_on='employee_id',
        right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512